package com.company;

public class Task6 {
    //Дано натуральное число. Выведите его последнюю цифру.
    public static void main(String[] args) {
        int abc = 123;
        System.out.println(abc%10);
    }
}
