package com.company;

public class Task3 {
    //Создайте переменную, увеличьте её на единицу несколькими способами и выведите значение на экран.
    public static void main(String[] args) {
        int x = 5;
        System.out.println("x1 = "+x);
        ++x;
        System.out.println("x2 = "+x);
        x= x+1;
        System.out.println("x3 = "+x);
    }
}
