package com.company;

public class Task8 {
    //Дано двузначное число. Найдите число десятков в нем.
    public static void main(String[] args) {
        int x = 254;
        System.out.println(x/10);
    }
}
