package com.company;

public class Task2 {
    //Создайте переменную, присвойте ей целочисленное значение. Выведите значение на экран
    public static void main(String[] args) {
        int x;
        x = 10;
        System.out.println(x);
    }
}
