faculty = [
    "Прикладная математика и информационные технологии",           
    "Государственное управление и финансовый контроль",
    "Менеджмент",
    "Международные экономические отношения",
    "Международный туризм, спорт и гостиничный бизнес",
    "Социология и политология",
    "Финансово-экономический",
    "Финансовых рынков",
    "Юридический"
] 

jobs = [
    "Старший научный сотрудник",
    "Старший преподаватель",
    "Профессор",
    "Преподаватель",
    "Научный сотрудник",            
    "Доцент",
    "Докторант",
    "Младший научный сотрудник",
    "Главный научный сотрудник",
    "Ведущий научный сотрудник",
    "Ассистент"
]